In [15]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [16]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

1. .read_csv("File_name.csv")
2. .head()
3. .tail()
4. .dtypes()
5. .columns()
6. .to_csv("File_name.csv")

In [17]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [18]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [20]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [21]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [22]:
df.to_csv("Titanic.csv")

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [23]:
data1 = {'A' : 10 ,'B' : 20 , 'C' : 30}

In [24]:
len(data1)

3

In [25]:
def Create_Index_List(Start_Index , Increment , length):
    Index=[]
    
    for _ in range(length):
        Index.append(Start_Index)
        Start_Index +=2
    return Index

In [26]:
df1 = pd.DataFrame(data1 , index = Create_Index_List(1,2,len(data1)))

In [27]:
df1

    A   B   C
1  10  20  30
3  10  20  30
5  10  20  30

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.


For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [28]:
data2 = {'Values' : [10,20,30,40,50]}

In [29]:
df2 = pd.DataFrame(data2)

In [30]:
df2.columns

Index(['Values'], dtype='object')

In [31]:
list(df2.columns)

['Values']

In [32]:
df2[["Values"]]

   Values
0      10
1      20
2      30
3      40
4      50

In [33]:
df2['Values'][0]

10

In [34]:
def Calculate_Sum(df):
    a = df['Values']
    b = a.head(3)
    sum = b.sum()
    return sum

In [35]:
Calculate_Sum(df2)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [36]:
data3 = {'Text' : ["Rishabh Singh" , "I am a Student"]}

In [37]:
df3 = pd.DataFrame(data3)

In [38]:
list(df3.columns)

['Text']

In [39]:
df3

             Text
0   Rishabh Singh
1  I am a Student

In [40]:
import re

In [41]:
def count_Words(text):
    words = re.findall(r'\w+' , text)
    return len(words)

In [42]:
def add_Column(df):
    df['Word_Count']  = df['Text'].apply(count_Words)
    return df

In [43]:
add_Column(df3)

             Text  Word_Count
0   Rishabh Singh           2
1  I am a Student           4

Q5. How are DataFrame.size() and DataFrame.shape() different?

In the context of pandas, a popular data manipulation library in Python, both `DataFrame.size` and `DataFrame.shape` are attributes that provide information about the structure of a DataFrame, but they provide different types of information.

1. **DataFrame.size:**
   - The `DataFrame.size` attribute returns the total number of elements in the DataFrame.
   - It's calculated by multiplying the number of rows (`DataFrame.shape[0]`) by the number of columns (`DataFrame.shape[1]`).
   - It gives you the total count of cells in the DataFrame, which includes all individual data points.

2. **DataFrame.shape:**
   - The `DataFrame.shape` attribute returns a tuple representing the dimensions of the DataFrame.
   - It returns a tuple in the format `(rows, columns)`.
   - The value at index 0 (`DataFrame.shape[0]`) represents the number of rows in the DataFrame.
   - The value at index 1 (`DataFrame.shape[1]`) represents the number of columns in the DataFrame.

In summary, the key difference between `DataFrame.size` and `DataFrame.shape` lies in what information they provide. `DataFrame.size` gives you the total number of elements (cells) in the DataFrame, while `DataFrame.shape` gives you the dimensions (number of rows and columns) of the DataFrame.

Q6. Which function of pandas do we use to read an excel file?

panda.read_excel()

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.


The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [44]:
def userName(s):
    for i in range(len(s)):
        if s[i]=='@':
            s = s[0:i]
            return s

In [45]:
def create_userName_Column(df):
    df['Username'] = df['Email'].apply(userName)
    return df

In [46]:
data4 = {'Email' : ['username@domain.com' , 'john.doe@example.com' , 'rishabhsinghpanna13@gmail.com']}

In [47]:
df4 = pd.DataFrame(data4)

In [48]:
create_userName_Column(df4)

                           Email             Username
0            username@domain.com             username
1           john.doe@example.com             john.doe
2  rishabhsinghpanna13@gmail.com  rishabhsinghpanna13

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2


Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [49]:
data5 = {'A' : [3,8,6,2,9] , 'B' : [5,2,9,3,1] , 'C' : [1,7,4,5,2]}

In [50]:
df5 = pd.DataFrame(data5)

In [51]:
df5

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [55]:
df5[(df5['A']>5) & (df5['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [56]:
def returnNewDataFrame(df):
    a = df[(df['A']>5) & (df['B']<10)]
    return a

In [57]:
returnNewDataFrame(df5)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [59]:
df = pd.DataFrame(data2)

In [60]:
df

   Values
0      10
1      20
2      30
3      40
4      50

In [89]:
def mean_median_stdDeviation(df):
    return df['Values'].mean() ,df['Values'].median() , df['Values'].std()

In [90]:
mean_median_stdDeviation(df)

(30.0, 30.0, 15.811388300841896)

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [93]:
def calculate_moving_average(df):
    # Calculate moving average with a window size of 7 days
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    return df

In [94]:
data = {'Date': ['2023-08-01', '2023-08-02', '2023-08-03', '2023-08-04', '2023-08-05', '2023-08-06', '2023-08-07'],
        'Sales': [100, 120, 80, 150, 130, 110, 90]}

In [95]:
df = pd.DataFrame(data)

In [96]:
df['Date'] = pd.to_datetime(df['Date'])  # Convert 'Date' column to datetime type

In [98]:
df = df.sort_values(by='Date')  # Sort DataFrame by date

In [99]:
df

        Date  Sales
0 2023-08-01    100
1 2023-08-02    120
2 2023-08-03     80
3 2023-08-04    150
4 2023-08-05    130
5 2023-08-06    110
6 2023-08-07     90

In [100]:
calculate_moving_average(df)

        Date  Sales  MovingAverage
0 2023-08-01    100     100.000000
1 2023-08-02    120     110.000000
2 2023-08-03     80     100.000000
3 2023-08-04    150     112.500000
4 2023-08-05    130     116.000000
5 2023-08-06    110     115.000000
6 2023-08-07     90     111.428571

In [101]:
data90 = {'Date': ['2023-08-01', '2023-08-02', '2023-08-03'] , 'Sales' : [100, 120, 80]}

In [102]:
df90 = pd.DataFrame(data90)

In [104]:
calculate_moving_average(df90)

         Date  Sales  MovingAverage
0  2023-08-01    100          100.0
1  2023-08-02    120          110.0
2  2023-08-03     80          100.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [105]:
def add_weekday_column(df):
    # Convert 'Date' column to datetime type if not already
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Extract weekday name and create 'Weekday' column
    df['Weekday'] = df['Date'].dt.strftime('%A')
    
    return df

In [110]:
data7 = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']}

In [107]:
df7 = pd.DataFrame(data7)

In [108]:
add_weekday_column(df7)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [112]:
data12 = {'Date':['2022-12-31' ,'2023-01-01' ,'2023-01-02' ,'2023-01-03' , '2023-02-01' , '2023-01-24' ]}

In [113]:
df12 = pd.DataFrame(data12)

In [116]:
def select_columns(df):
    df['Date'] = pd.to_datetime(df['Date'])
    return df[(df['Date'] > pd.to_datetime('2023-01-01')) & (df['Date'] < pd.to_datetime('2023-01-31'))]

In [117]:
select_columns(df12)

        Date
2 2023-01-02
3 2023-01-03
5 2023-01-24

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

pandas